Revit 2024 API
AnalyticalNodeData Class
 This class holds information related to analytical model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class AnalyticalNodeData : IDisposable
Visual Basic
Public Class AnalyticalNodeData _
	Implements IDisposable
Visual C++
public ref class AnalyticalNodeData : IDisposable
Remarks
 This class is attached to a ReferencePoint.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.AnalyticalNodeData
See Also
AnalyticalNodeData Members
Autodesk.Revit.DB.Structure Namespace